Revit 2027 API
AlignmentStationLabelSetOptions.TypeId Property
 Specifies the ElementId of the labels' type. The default value is InvalidElementId. in this case, CreateSet(Alignment, View, AlignmentStationLabelSetOptions) will throw an exception.
Namespace: Autodesk.Revit.DB.Infrastructure
Assembly: Autodesk.CivilAlignments.DBApplication (in Autodesk.CivilAlignments.DBApplication.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId TypeId { get; set; }
Public Property TypeId As ElementId
	Get
	Set
public:
property ElementId^ TypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
member TypeId : ElementId with get, set
Property Value
ElementId
Remarks
 Recommended types can be found using IsRecommendedTypeForSet(Element) Other valid types can be found using IsValidType(Element).
See Also
Reference
AlignmentStationLabelSetOptions Class
Autodesk.Revit.DB.Infrastructure Namespace